pmo-dataset/variations/mermaid_with_ids/13.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Resolve complaint"]
	Task_2["Approve and notify\ncustomer"]
	Task_3["Process\nreimbursement"]
	Task_4["Provide feedback"]
	Task_5["Log complaint"]
	Task_6["Assign complaint to\nrelevant department"]
	Task_7["File complaint"]
	Task_8["Reject and notify\ncustomer"]
	Task_9["Review complaint\ndetails"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}

	StartNoneEvent_1 --> Task_7
	ExclusiveGateway_3 --> Task_1
	Task_1 --> ExclusiveGateway_4
	ExclusiveGateway_4 --> Task_4
	ExclusiveGateway_1 --> EndNoneEvent_1
	ExclusiveGateway_4 --> ExclusiveGateway_1
	ExclusiveGateway_2 --> Task_2
	Task_8 --> ExclusiveGateway_3
	Task_5 --> Task_6
	Task_9 --> ExclusiveGateway_2
	Task_4 --> ExclusiveGateway_1
	Task_7 --> Task_5
	ExclusiveGateway_2 --> Task_8
	Task_3 --> ExclusiveGateway_3
	Task_2 --> Task_3
	Task_6 --> Task_9
